fio/test_suite_sd_results/bs32k_read40write60.txt
bs32k_read40write60: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs32k_read40write60: Laying out IO file (1 file / 100MiB)
bs32k_read40write60: Laying out IO file (1 file / 100MiB)
bs32k_read40write60: Laying out IO file (1 file / 100MiB)
[...]

bs32k_read40write60: (groupid=0, jobs=4): err= 0: pid=3473: Sun Jun  8 21:46:16 2025
  read: IOPS=57, BW=1838KiB/s (1882kB/s)(61.0MiB/33993msec)
    clat (msec): min=4, max=3867, avg=46.49, stdev=245.05
     lat (msec): min=4, max=3867, avg=46.50, stdev=245.05
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
     | 30.00th=[    9], 40.00th=[    9], 50.00th=[    9], 60.00th=[   20],
     | 70.00th=[   21], 80.00th=[   21], 90.00th=[   21], 95.00th=[   21],
     | 99.00th=[ 1284], 99.50th=[ 2123], 99.90th=[ 3876], 99.95th=[ 3876],
     | 99.99th=[ 3876]
   bw (  KiB/s): min=  252, max=15168, per=100.00%, avg=4334.37, stdev=1189.00, samples=115
   iops        : min=    4, max=  474, avg=133.59, stdev=37.29, samples=115
  write: IOPS=88, BW=2836KiB/s (2904kB/s)(94.2MiB/33993msec); 0 zone resets
    clat (usec): min=50, max=6681.0k, avg=13714.27, stdev=269949.70
     lat (usec): min=51, max=6681.0k, avg=13716.54, stdev=269949.82
    clat percentiles (usec):
     |  1.00th=[     52],  5.00th=[     53], 10.00th=[     54],
     | 20.00th=[     57], 30.00th=[     61], 40.00th=[     71],
     | 50.00th=[     91], 60.00th=[    108], 70.00th=[    121],
     | 80.00th=[    137], 90.00th=[    161], 95.00th=[    186],
     | 99.00th=[    330], 99.50th=[    619], 99.90th=[6341788],
     | 99.95th=[6677332], 99.99th=[6677332]
   bw (  KiB/s): min=  252, max=25497, per=100.00%, avg=7889.76, stdev=1877.95, samples=98
   iops        : min=    4, max=  795, avg=244.95, stdev=58.81, samples=98
  lat (usec)   : 100=33.45%, 250=26.26%, 500=0.52%, 750=0.16%, 1000=0.04%
  lat (msec)   : 10=20.42%, 20=9.47%, 50=7.90%, 100=0.16%, 500=0.95%
  lat (msec)   : 750=0.02%, 2000=0.24%, >=2000=0.40%
  cpu          : usr=0.08%, sys=0.44%, ctx=2070, majf=0, minf=114
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1952,3013,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1838KiB/s (1882kB/s), 1838KiB/s-1838KiB/s (1882kB/s-1882kB/s), io=61.0MiB (64.0MB), run=33993-33993msec
  WRITE: bw=2836KiB/s (2904kB/s), 2836KiB/s-2836KiB/s (2904kB/s-2904kB/s), io=94.2MiB (98.7MB), run=33993-33993msec

Disk stats (read/write):
  mmcblk0: ios=2181/701, merge=209/10, ticks=90635/2421053, in_queue=2511688, util=97.57%