fio/test_suite_sd_results/bs32k_read60write40.txt
bs32k_read60write40: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs32k_read60write40: Laying out IO file (1 file / 100MiB)
bs32k_read60write40: Laying out IO file (1 file / 100MiB)
bs32k_read60write40: Laying out IO file (1 file / 100MiB)
[...]

bs32k_read60write40: (groupid=0, jobs=4): err= 0: pid=3427: Sun Jun  8 21:44:11 2025
  read: IOPS=106, BW=3411KiB/s (3492kB/s)(113MiB/34002msec)
    clat (msec): min=2, max=2303, avg=25.95, stdev=122.66
     lat (msec): min=2, max=2303, avg=25.95, stdev=122.66
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
     | 30.00th=[    9], 40.00th=[    9], 50.00th=[    9], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[    9], 95.00th=[    9],
     | 99.00th=[  414], 99.50th=[  439], 99.90th=[ 1871], 99.95th=[ 2299],
     | 99.99th=[ 2299]
   bw (  KiB/s): min=  252, max=15616, per=100.00%, avg=5722.81, stdev=1757.22, samples=162
   iops        : min=    4, max=  488, avg=178.27, stdev=54.96, samples=162
  write: IOPS=75, BW=2413KiB/s (2471kB/s)(80.1MiB/34002msec); 0 zone resets
    clat (usec): min=51, max=5544.4k, avg=11918.86, stdev=236361.32
     lat (usec): min=52, max=5544.4k, avg=11921.34, stdev=236361.45
    clat percentiles (usec):
     |  1.00th=[     53],  5.00th=[     55], 10.00th=[     57],
     | 20.00th=[     69], 30.00th=[     90], 40.00th=[     98],
     | 50.00th=[    109], 60.00th=[    116], 70.00th=[    125],
     | 80.00th=[    147], 90.00th=[    176], 95.00th=[    196],
     | 99.00th=[    285], 99.50th=[    742], 99.90th=[5536482],
     | 99.95th=[5536482], 99.99th=[5536482]
   bw (  KiB/s): min=  254, max=14336, per=100.00%, avg=6312.88, stdev=1290.63, samples=105
   iops        : min=    6, max=  448, avg=196.76, stdev=40.39, samples=105
  lat (usec)   : 100=17.15%, 250=23.56%, 500=0.48%, 750=0.05%, 1000=0.03%
  lat (msec)   : 4=0.02%, 10=56.38%, 20=0.23%, 500=1.70%, 750=0.06%
  lat (msec)   : 2000=0.19%, >=2000=0.15%
  cpu          : usr=0.12%, sys=0.59%, ctx=3827, majf=0, minf=116
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3624,2564,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3411KiB/s (3492kB/s), 3411KiB/s-3411KiB/s (3492kB/s-3492kB/s), io=113MiB (119MB), run=34002-34002msec
  WRITE: bw=2413KiB/s (2471kB/s), 2413KiB/s-2413KiB/s (2471kB/s-2471kB/s), io=80.1MiB (84.0MB), run=34002-34002msec

Disk stats (read/write):
  mmcblk0: ios=3624/790, merge=0/5, ticks=85388/2689189, in_queue=2774576, util=95.16%