fio/test_suite_sd_results/bs32k_read60write40.txt
bs32k_read60write40: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs32k_read60write40: Laying out IO file (1 file / 100MiB)
bs32k_read60write40: Laying out IO file (1 file / 100MiB)
bs32k_read60write40: Laying out IO file (1 file / 100MiB)
[...]

bs32k_read60write40: (groupid=0, jobs=4): err= 0: pid=2809: Sun Jun  8 20:05:51 2025
  read: IOPS=115, BW=3693KiB/s (3781kB/s)(111MiB/30814msec)
    clat (msec): min=2, max=2927, avg=26.91, stdev=162.56
     lat (msec): min=2, max=2927, avg=26.91, stdev=162.56
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[    8], 20.00th=[    8],
     | 30.00th=[    9], 40.00th=[    9], 50.00th=[    9], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[    9], 95.00th=[    9],
     | 99.00th=[  426], 99.50th=[ 1401], 99.90th=[ 2937], 99.95th=[ 2937],
     | 99.99th=[ 2937]
   bw (  KiB/s): min=  252, max=15872, per=100.00%, avg=7271.16, stdev=1827.77, samples=125
   iops        : min=    4, max=  496, avg=224.98, stdev=57.33, samples=125
  write: IOPS=81, BW=2611KiB/s (2673kB/s)(78.6MiB/30814msec); 0 zone resets
    clat (usec): min=51, max=6081.8k, avg=10926.50, stdev=228279.74
     lat (usec): min=52, max=6081.8k, avg=10929.10, stdev=228279.86
    clat percentiles (usec):
     |  1.00th=[     53],  5.00th=[     55], 10.00th=[     58],
     | 20.00th=[     86], 30.00th=[     93], 40.00th=[    102],
     | 50.00th=[    113], 60.00th=[    121], 70.00th=[    141],
     | 80.00th=[    161], 90.00th=[    180], 95.00th=[    198],
     | 99.00th=[    265], 99.50th=[   1045], 99.90th=[5268046],
     | 99.95th=[5670700], 99.99th=[6073353]
   bw (  KiB/s): min=  252, max=14128, per=100.00%, avg=7038.68, stdev=1283.04, samples=92
   iops        : min=    4, max=  440, avg=217.77, stdev=40.35, samples=92
  lat (usec)   : 100=15.83%, 250=25.12%, 500=0.12%, 750=0.08%, 1000=0.05%
  lat (msec)   : 2=0.02%, 4=0.03%, 10=57.07%, 20=0.15%, 250=0.07%
  lat (msec)   : 500=0.84%, 750=0.13%, 1000=0.05%, 2000=0.23%, >=2000=0.21%
  cpu          : usr=0.13%, sys=0.61%, ctx=3684, majf=0, minf=115
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3556,2514,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3693KiB/s (3781kB/s), 3693KiB/s-3693KiB/s (3781kB/s-3781kB/s), io=111MiB (117MB), run=30814-30814msec
  WRITE: bw=2611KiB/s (2673kB/s), 2611KiB/s-2611KiB/s (2673kB/s-2673kB/s), io=78.6MiB (82.4MB), run=30814-30814msec

Disk stats (read/write):
  mmcblk0: ios=3552/544, merge=0/5, ticks=72276/2331075, in_queue=2403352, util=97.15%