fio/test_suite_sd_results/bs32k_write100.txt
bs32k_write100: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs32k_write100: Laying out IO file (1 file / 100MiB)
bs32k_write100: Laying out IO file (1 file / 100MiB)
bs32k_write100: Laying out IO file (1 file / 100MiB)
[...]

bs32k_write100: (groupid=0, jobs=4): err= 0: pid=3526: Sun Jun  8 21:48:29 2025
  write: IOPS=233, BW=7474KiB/s (7653kB/s)(220MiB/30155msec); 0 zone resets
    clat (usec): min=50, max=3881.7k, avg=17080.08, stdev=122913.46
     lat (usec): min=51, max=3881.7k, avg=17083.27, stdev=122913.51
    clat percentiles (usec):
     |  1.00th=[     55],  5.00th=[     79], 10.00th=[     90],
     | 20.00th=[     97], 30.00th=[    103], 40.00th=[    108],
     | 50.00th=[    114], 60.00th=[    121], 70.00th=[    135],
     | 80.00th=[    167], 90.00th=[    586], 95.00th=[ 123208],
     | 99.00th=[ 204473], 99.50th=[ 204473], 99.90th=[2105541],
     | 99.95th=[3808429], 99.99th=[3875537]
   bw (  KiB/s): min=  380, max=230272, per=100.00%, avg=9670.02, stdev=8315.57, samples=186
   iops        : min=    8, max= 7196, avg=299.58, stdev=259.97, samples=186
  lat (usec)   : 100=24.55%, 250=64.40%, 500=0.87%, 750=0.26%, 1000=0.27%
  lat (msec)   : 2=0.03%, 10=0.01%, 20=0.01%, 100=2.66%, 250=6.72%
  lat (msec)   : 500=0.04%, 750=0.01%, >=2000=0.17%
  cpu          : usr=0.07%, sys=0.77%, ctx=699, majf=0, minf=109
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7043,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=7474KiB/s (7653kB/s), 7474KiB/s-7474KiB/s (7653kB/s-7653kB/s), io=220MiB (231MB), run=30155-30155msec

Disk stats (read/write):
  mmcblk0: ios=0/268, merge=0/37, ticks=0/537954, in_queue=537954, util=94.95%