fio/test_suite_sd_results/bs4k_read60write40.txt
bs4k_read60write40: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs4k_read60write40: Laying out IO file (1 file / 100MiB)
bs4k_read60write40: Laying out IO file (1 file / 100MiB)
bs4k_read60write40: Laying out IO file (1 file / 100MiB)
[...]

bs4k_read60write40: (groupid=0, jobs=4): err= 0: pid=3197: Sun Jun  8 21:19:37 2025
  read: IOPS=892, BW=3568KiB/s (3654kB/s)(107MiB/30590msec)
    clat (usec): min=1246, max=1660.5k, avg=3582.40, stdev=21215.80
     lat (usec): min=1246, max=1660.5k, avg=3583.16, stdev=21215.83
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[    4], 99.50th=[   59], 99.90th=[  144], 99.95th=[  174],
     | 99.99th=[ 1519]
   bw (  KiB/s): min=   44, max= 5856, per=100.00%, avg=4590.97, stdev=560.81, samples=190
   iops        : min=    8, max= 1464, avg=1146.95, stdev=140.36, samples=190
  write: IOPS=606, BW=2427KiB/s (2486kB/s)(72.5MiB/30590msec); 0 zone resets
    clat (usec): min=10, max=6054.3k, avg=1285.67, stdev=84942.98
     lat (usec): min=10, max=6054.3k, avg=1286.74, stdev=84943.02
    clat percentiles (usec):
     |  1.00th=[     12],  5.00th=[     13], 10.00th=[     16],
     | 20.00th=[     19], 30.00th=[     21], 40.00th=[     26],
     | 50.00th=[     33], 60.00th=[     43], 70.00th=[     47],
     | 80.00th=[     53], 90.00th=[     61], 95.00th=[     69],
     | 99.00th=[     94], 99.50th=[    111], 99.90th=[    210],
     | 99.95th=[   6194], 99.99th=[5804917]
   bw (  KiB/s): min=   46, max= 4698, per=100.00%, avg=3278.34, stdev=360.31, samples=181
   iops        : min=   10, max= 1174, avg=818.57, stdev=90.22, samples=181
  lat (usec)   : 20=10.41%, 50=20.34%, 100=9.43%, 250=0.27%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=59.14%, 10=0.05%, 20=0.01%, 100=0.12%
  lat (msec)   : 250=0.18%, 500=0.01%, 2000=0.01%, >=2000=0.01%
  cpu          : usr=0.51%, sys=1.92%, ctx=27551, majf=0, minf=124
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=27290,18564,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3568KiB/s (3654kB/s), 3568KiB/s-3568KiB/s (3654kB/s-3654kB/s), io=107MiB (112MB), run=30590-30590msec
  WRITE: bw=2427KiB/s (2486kB/s), 2427KiB/s-2427KiB/s (2486kB/s-2486kB/s), io=72.5MiB (76.0MB), run=30590-30590msec

Disk stats (read/write):
  mmcblk0: ios=27288/1106, merge=0/5, ticks=91079/1272162, in_queue=1363242, util=90.73%